{
  "backend/main.mo": "Defines financial goals, investments, linking structures, analytics types, access control, and CRUD-supporting state for the Motoko backend canister.",
  "feature_evidence.json": "Lists feature evidence records mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains a JSON-style mapping of frontend file paths to their human‑written functional summaries.",
  "frontend/index.css": "Tailwind CSS base, components, and utilities with OKLCH design tokens for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main app component handling authentication, actor readiness, profile setup, dashboard rendering, and connection error states.",
  "frontend/src/components/AddGoalDialog.tsx": "Dialog component for creating financial goals with actor readiness gating and form submission logic.",
  "frontend/src/components/AddInvestmentDialog.tsx": "Dialog component for creating a new investment with category, subcategory, amounts, and date, submitting via useAddInvestment.",
  "frontend/src/components/AnalyticsModule.tsx": "Empty placeholder file for the analytics module component.",
  "frontend/src/components/ConnectionErrorState.tsx": "Displays a detailed connection error message with retry handling and conditional guidance for canister-stopped cases.",
  "frontend/src/components/DashboardModule.tsx": "Fetches and visualizes dashboard analytics including goals, investments, charts, and summaries using Recharts.",
  "frontend/src/components/EditGoalDialog.tsx": "Dialog for editing an existing financial goal, updating name, amount, date, and category via useUpdateFinancialGoal.",
  "frontend/src/components/EditInvestmentDialog.tsx": "Dialog for editing an investment’s category, subcategory, values, and date, submitting updates through useUpdateInvestment.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright, a link to caffeine.ai, and a GitHub icon.",
  "frontend/src/components/GoalsModule.tsx": "Fetches and displays financial goals with analytics, and supports adding, editing, linking investments, and deleting goals.",
  "frontend/src/components/Header.tsx": "Renders the top navigation bar with theme toggle, login/logout handling, and user profile avatar.",
  "frontend/src/components/InvestmentsModule.tsx": "Shows the user's investment portfolio, calculates gains, and provides add, edit, and delete investment actions.",
  "frontend/src/components/LinkInvestmentDialog.tsx": "Dialog for linking an investment to a financial goal, allowing selection and allocation of an amount.",
  "frontend/src/components/ProfileSetup.tsx": "Simple profile setup form that saves the user's name before onboarding completes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reinitializing dependent queries when identity changes.",
  "frontend/src/hooks/useActorClient.ts": "Builds an actor client with optional admin-token initialization and exposes query state for consumer components.",
  "frontend/src/hooks/useActorReadiness.ts": "Manages actor initialization readiness with caching, timeout handling, and replica error classification.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, loading, login, logout, and AuthClient setup for the app.",
  "frontend/src/hooks/usePrefetchTabQueries.ts": "Prefetches dashboard, goals, and analytics queries once the actor is ready to speed up tab switching.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, goals, investments, and analytics via the actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light and dark theme color systems.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page with tabbed navigation for dashboard, goals, and investments, using prefetching for performance.",
  "frontend/src/utils/dashboardAnalytics.ts": "Utility functions for generating investment time series and goal deadline insights.",
  "frontend/src/utils/icReplicaErrors.ts": "Classifies IC replica errors, detecting canister-stopped conditions and providing normalized error info.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL/query/hash params and persisting them in sessionStorage, with helpers to clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, layout, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing the app’s architecture, features, and known issues for the FinancePro full‑stack ICP financial planner."
}